# UNDERSTANDING JINJA
Jinja是SLS文件中的默认模板语言。

## JINJA IN STATES
Jinja在YAML之前进行评定，这意味着它在States运行之前进行评定。

Jinja在state状态文件中最基本的用法是使用控制结构来包装条件或处理冗余的状态元素取值：
```Jinja
{% if grains['os'] != 'FreeBSD' %}
tcsh:
    pkg:
        - installed
{% endif %}

motd:
  file.managed:
    {% if grains['os'] == 'FreeBSD' %}
    - name: /etc/motd
    {% elif grains['os'] == 'Debian' %}
    - name: /etc/motd.tail
    {% endif %}
    - source: salt://motd
```
在此示例中，第一个`if块`仅在未运行FreeBSD的minions上进行计算，第二个块根据`os grain`更改配置文件的文件名。

编写`if-else块`会导致非常冗余的状态文件。 在这种情况下，使用pillar或使用先前定义的变量可能更容易：
```Jinja
{% set motd = ['/etc/motd'] %}
{% if grains['os'] == 'Debian' %}
  {% set motd = ['/etc/motd.tail', '/var/run/motd'] %}
{% endif %}

{% for motdfile in motd %}
{{ motdfile }}:
  file.managed:
    - source: salt://motd
{% endfor %}
```
使用模板设置的变量，for循环将遍历要更新的MOTD文件列表，为每个文件添加状态块。

`filter_by`函数也可用于根据grain设置变量：
```jinja
{% set auditd = salt['grains.filter_by']({
'RedHat': { 'package': 'audit' },
'Debian': { 'package': 'auditd' },
}) %}
```

## INCLUDE AND IMPORT
Includes和[imports](http://jinja.pocoo.org/docs/templates/#import)可用于在状态文件之间、文件之间共享那些通用且可重用的状态配置。
```JINJA
{% from 'lib.sls' import test %}
```
这将从文件`lib.sls`导入`test`模板变量或宏，而不是`test` state元素。 如果包含的文件对grains或其他需要上下文的内容执行检查，则需要将上下文也传递到包含的文件中：
```jinja
{% from 'lib.sls' import test with context %}
```

Includes 在使用时必须引用完整路径，如下所示:

`spam/eggs.jinja`
```jinja
 {% include 'spam/foobar.jinja' %}
```

**INCLUDING CONTEXT DURING INCLUDE/IMPORT**

通过向include/importe指令添加`with context`，可以将当前上下文传递给执行include/importe的模板。
```jinja
{% import 'openssl/vars.sls' as ssl with context %}
```

## MACROS
[Macros](http://jinja.pocoo.org/docs/templates/#macros)有助于消除冗余代码。 宏作为迷你模板时最有用，用来通过借助一些参数化变量处理重复字符串块。 请注意，从模板块中剥离空格以及包含的块可能是模拟宏的变量返回所必需的。
```jinja
# init.sls
{% from 'lib.sls' import pythonpkg with context %}

python-virtualenv:
  pkg.installed:
    - name: {{ pythonpkg('virtualenv') }}

python-fabric:
  pkg.installed:
    - name: {{ pythonpkg('fabric') }}
```
```jinja
# lib.sls
{% macro pythonpkg(pkg) -%}
  {%- if grains['os'] == 'FreeBSD' -%}
    py27-{{ pkg }}
  {%- elif grains['os'] == 'Debian' -%}
    python-{{ pkg }}
  {%- endif -%}
{%- endmacro %}
```
这将定义一个宏，它将返回完整包名称的字符串，具体返回值则取决于打包系统的命名约定。 宏的空白将被删除，因此宏将使用[空格控件](http://jinja.pocoo.org/docs/templates/#whitespace-control)返回一个没有换行符的字符串。

## TEMPLATE INHERITANCE

https://docs.saltstack.com/en/latest/topics/jinja/index.html#template-inheritance

Template inheritance works fine from state files and files. The search path starts at the root of the state tree or pillar.

ERRORS
Saltstack allows raising custom errors using the raise jinja function.

{{ raise('Custom Error') }}
When rendering the template containing the above statement, a TemplateError exception is raised, causing the rendering to fail with the following message:

TemplateError: Custom Error
FILTERS
Saltstack extends builtin filters with these custom filters:

STRFTIME
Converts any time related object into a time based string. It requires valid strftime directives. An exhaustive list can be found here in the Python documentation.

{% set curtime = None | strftime() %}
Fuzzy dates require the timelib Python module is installed.

{{ "2002/12/25"|strftime("%y") }}
{{ "1040814000"|strftime("%Y-%m-%d") }}
{{ datetime|strftime("%u") }}
{{ "tomorrow"|strftime }}
SEQUENCE
Ensure that parsed data is a sequence.

YAML_ENCODE
Serializes a single object into a YAML scalar with any necessary handling for escaping special characters. This will work for any scalar YAML data type: ints, floats, timestamps, booleans, strings, unicode. It will not work for multi-objects such as sequences or maps.

{%- set bar = 7 %}
{%- set baz = none %}
{%- set zip = true %}
{%- set zap = 'The word of the day is "salty"' %}

{%- load_yaml as foo %}
bar: {{ bar|yaml_encode }}
baz: {{ baz|yaml_encode }}
zip: {{ zip|yaml_encode }}
zap: {{ zap|yaml_encode }}
{%- endload %}
In the above case {{ bar }} and {{ foo.bar }} should be identical and {{ baz }} and {{ foo.baz }} should be identical.

YAML_DQUOTE
Serializes a string into a properly-escaped YAML double-quoted string. This is useful when the contents of a string are unknown and may contain quotes or unicode that needs to be preserved. The resulting string will be emitted with opening and closing double quotes.

{%- set bar = '"The quick brown fox . . ."' %}
{%- set baz = 'The word of the day is "salty".' %}

{%- load_yaml as foo %}
bar: {{ bar|yaml_dquote }}
baz: {{ baz|yaml_dquote }}
{%- endload %}
In the above case {{ bar }} and {{ foo.bar }} should be identical and {{ baz }} and {{ foo.baz }} should be identical. If variable contents are not guaranteed to be a string then it is better to use yaml_encode which handles all YAML scalar types.

YAML_SQUOTE
Similar to the yaml_dquote filter but with single quotes. Note that YAML only allows special escapes inside double quotes so yaml_squote is not nearly as useful (viz. you likely want to use yaml_encode or yaml_dquote).

TO_BOOL
New in version 2017.7.0.

Returns the logical value of an element.

Example:

{{ 'yes' | to_bool }}
{{ 'true' | to_bool }}
{{ 1 | to_bool }}
{{ 'no' | to_bool }}
Will be rendered as:

True
True
True
False
EXACTLY_N_TRUE
New in version 2017.7.0.

Tests that exactly N items in an iterable are "truthy" (neither None, False, nor 0).

Example:

{{ ['yes', 0, False, 'True'] | exactly_n_true(2) }}
Returns:

True
EXACTLY_ONE_TRUE
New in version 2017.7.0.

Tests that exactly one item in an iterable is "truthy" (neither None, False, nor 0).

Example:

{{ ['yes', False, 0, None] | exactly_one_true }}
Returns:

True
QUOTE
New in version 2017.7.0.

This text will be wrapped in quotes.

REGEX_SEARCH
New in version 2017.7.0.

Scan through string looking for a location where this regular expression produces a match. Returns None in case there were no matches found

Example:

{{ 'abcdefabcdef' | regex_search('BC(.*)', ignorecase=True) }}
Returns:

('defabcdef',)
REGEX_MATCH
New in version 2017.7.0.

If zero or more characters at the beginning of string match this regular expression, otherwise returns None.

Example:

{{ 'abcdefabcdef' | regex_match('BC(.*)', ignorecase=True) }}
Returns:

None
REGEX_REPLACE
New in version 2017.7.0.

Searches for a pattern and replaces with a sequence of characters.

Example:

{% set my_text = 'yes, this is a TEST' %}
{{ my_text | regex_replace(' ([a-z])', '__\\1', ignorecase=True) }}
Returns:

yes,__this__is__a__TEST
UUID
New in version 2017.7.0.

Return a UUID.

Example:

{{ 'random' | uuid }}
Returns:

3652b285-26ad-588e-a5dc-c2ee65edc804
IS_LIST
New in version 2017.7.0.

Return if an object is list.

Example:

{{ [1, 2, 3] | is_list }}
Returns:

True
IS_ITER
New in version 2017.7.0.

Return if an object is iterable.

Example:

{{ [1, 2, 3] | is_iter }}
Returns:

True
MIN
New in version 2017.7.0.

Return the minimum value from a list.

Example:

{{ [1, 2, 3] | min }}
Returns:

1
MAX
New in version 2017.7.0.

Returns the maximum value from a list.

Example:

{{ [1, 2, 3] | max }}
Returns:

3
AVG
New in version 2017.7.0.

Returns the average value of the elements of a list

Example:

{{ [1, 2, 3] | avg }}
Returns:

2
UNION
New in version 2017.7.0.

Return the union of two lists.

Example:

{{ [1, 2, 3] | union([2, 3, 4]) | join(', ') }}
Returns:

1, 2, 3, 4
INTERSECT
New in version 2017.7.0.

Return the intersection of two lists.

Example:

{{ [1, 2, 3] | intersect([2, 3, 4]) | join(', ') }}
Returns:

2, 3
DIFFERENCE
New in version 2017.7.0.

Return the difference of two lists.

Example:

{{ [1, 2, 3] | difference([2, 3, 4]) | join(', ') }}
Returns:

1
SYMMETRIC_DIFFERENCE
New in version 2017.7.0.

Return the symmetric difference of two lists.

Example:

{{ [1, 2, 3] | symmetric_difference([2, 3, 4]) | join(', ') }}
Returns:

1, 4
IS_SORTED
New in version 2017.7.0.

Return is an iterable object is already sorted.

Example:

{{ [1, 2, 3] | is_sorted }}
Returns:

True
COMPARE_LISTS
New in version 2017.7.0.

Compare two lists and return a dictionary with the changes.

Example:

{{ [1, 2, 3] | compare_lists([1, 2, 4]) }}
Returns:

{'new': 4, 'old': 3}
COMPARE_DICTS
New in version 2017.7.0.

Compare two dictionaries and return a dictionary with the changes.

Example:

{{ {'a': 'b'} | compare_lists({'a': 'c'}) }}
Returns:

{'a': {'new': 'c', 'old': 'b'}}
IS_HEX
New in version 2017.7.0.

Return True if the value is hexazecimal.

Example:

{{ '0xabcd' | is_hex }}
{{ 'xyzt' | is_hex }}
Returns:

True
False
CONTAINS_WHITESPACE
New in version 2017.7.0.

Return True if a text contains whitespaces.

Example:

{{ 'abcd' | contains_whitespace }}
{{ 'ab cd' | contains_whitespace }}
Returns:

False
True
SUBSTRING_IN_LIST
New in version 2017.7.0.

Return is a substring is found in a list of string values.

Example:

{{ 'abcd' | substring_in_list(['this', 'is', 'an abcd example']) }}
Returns:

True
CHECK_WHITELIST_BLACKLIST
New in version 2017.7.0.

Check a whitelist and/or blacklist to see if the value matches it.

This filter can be used with either a whitelist or a blacklist individually, or a whitelist and a blacklist can be passed simultaneously.

If whitelist is used alone, value membership is checked against the whitelist only. If the value is found, the function returns True. Otherwise, it returns False.

If blacklist is used alone, value membership is checked against the blacklist only. If the value is found, the function returns False. Otherwise, it returns True.

If both a whitelist and a blacklist are provided, value membership in the blacklist will be examined first. If the value is not found in the blacklist, then the whitelist is checked. If the value isn't found in the whitelist, the function returns False.

Whitelist Example:

{{ 5 | check_whitelist_blacklist(whitelist=[5, 6, 7]) }}
Returns:

True
Blacklist Example:

{{ 5 | check_whitelist_blacklist(blacklist=[5, 6, 7]) }}
False
DATE_FORMAT
New in version 2017.7.0.

Converts unix timestamp into human-readable string.

Example:

{{ 1457456400 | date_format }}
{{ 1457456400 | date_format('%d.%m.%Y %H:%M') }}
Returns:

2017-03-08
08.03.2017 17:00
TO_NUM
New in version 2017.7.0.

New in version 2018.3.0: Renamed from str_to_num to to_num.

Converts a string to its numerical value.

Example:

{{ '5' | to_num }}
Returns:

5
TO_BYTES
New in version 2017.7.0.

Converts string-type object to bytes.

Example:

{{ 'wall of text' | to_bytes }}
Note

This option may have adverse effects when using the default renderer, jinja|yaml. This is due to the fact that YAML requires proper handling in regard to special characters. Please see the section on YAML ASCII support in the YAML Idiosyncracies documentation for more information.

JSON_ENCODE_LIST
New in version 2017.7.0.

New in version 2018.3.0: Renamed from json_decode_list to json_encode_list. When you encode something you get bytes, and when you decode, you get your locale's encoding (usually a unicode type). This filter was incorrectly-named when it was added. json_decode_list will be supported until the Neon release.

Deprecated since version 2018.3.3,2019.2.0: The tojson filter accomplishes what this filter was designed to do, making this filter redundant.

Recursively encodes all string elements of the list to bytes.

Example:

{{ [1, 2, 3] | json_encode_list }}
Returns:

[1, 2, 3]
JSON_ENCODE_DICT
New in version 2017.7.0.

New in version 2018.3.0: Renamed from json_decode_dict to json_encode_dict. When you encode something you get bytes, and when you decode, you get your locale's encoding (usually a unicode type). This filter was incorrectly-named when it was added. json_decode_dict will be supported until the Neon release.

Deprecated since version 2018.3.3,2019.2.0: The tojson filter accomplishes what this filter was designed to do, making this filter redundant.

Recursively encodes all string items in the dictionary to bytes.

Example:

Assuming that pillar['foo'] contains {u'a': u'\u0414'}, and your locale is en_US.UTF-8:

{{ pillar['foo'] | json_encode_dict }}
Returns:

{'a': '\xd0\x94'}
TOJSON
New in version 2018.3.3,2019.2.0.

Dumps a data structure to JSON.

This filter was added to provide this functionality to hosts which have a Jinja release older than version 2.9 installed. If Jinja 2.9 or newer is installed, then the upstream version of the filter will be used. See the upstream docs for more information.

RANDOM_HASH
New in version 2017.7.0.

New in version 2018.3.0: Renamed from rand_str to random_hash to more accurately describe what the filter does. rand_str will be supported until the Neon release.

Generates a random number between 1 and the number passed to the filter, and then hashes it. The default hash type is the one specified by the minion's hash_type config option, but an alternate hash type can be passed to the filter as an argument.

Example:

{% set num_range = 99999999 %}
{{ num_range | random_hash }}
{{ num_range | random_hash('sha512') }}
Returns:

43ec517d68b6edd3015b3edc9a11367b
d94a45acd81f8e3107d237dbc0d5d195f6a52a0d188bc0284c0763ece1eac9f9496fb6a531a296074c87b3540398dace1222b42e150e67c9301383fde3d66ae5
MD5
New in version 2017.7.0.

Return the md5 digest of a string.

Example:

{{ 'random' | md5 }}
Returns:

7ddf32e17a6ac5ce04a8ecbf782ca509
SHA256
New in version 2017.7.0.

Return the sha256 digest of a string.

Example:

{{ 'random' | sha256 }}
Returns:

a441b15fe9a3cf56661190a0b93b9dec7d04127288cc87250967cf3b52894d11
SHA512
New in version 2017.7.0.

Return the sha512 digest of a string.

Example:

{{ 'random' | sha512 }}
Returns:

811a90e1c8e86c7b4c0eef5b2c0bf0ec1b19c4b1b5a242e6455be93787cb473cb7bc9b0fdeb960d00d5c6881c2094dd63c5c900ce9057255e2a4e271fc25fef1
BASE64_ENCODE
New in version 2017.7.0.

Encode a string as base64.

Example:

{{ 'random' | base64_encode }}
Returns:

cmFuZG9t
BASE64_DECODE
New in version 2017.7.0.

Decode a base64-encoded string.

{{ 'Z2V0IHNhbHRlZA==' | base64_decode }}
Returns:

get salted
HMAC
New in version 2017.7.0.

Verify a challenging hmac signature against a string / shared-secret. Returns a boolean value.

Example:

{{ 'get salted' | hmac('shared secret', 'eBWf9bstXg+NiP5AOwppB5HMvZiYMPzEM9W5YMm/AmQ=') }}
Returns:

True
HTTP_QUERY
New in version 2017.7.0.

Return the HTTP reply object from a URL.

Example:

{{ 'http://jsonplaceholder.typicode.com/posts/1' | http_query }}
Returns:

{
  'body': '{
    "userId": 1,
    "id": 1,
    "title": "sunt aut facere repellat provident occaecati excepturi option reprehenderit",
    "body": "quia et suscipit\\nsuscipit recusandae consequuntur expedita et cum\\nreprehenderit molestiae ut ut quas totam\\nnostrum rerum est autem sunt rem eveniet architecto"
  }'
}
TRAVERSE
New in version 2018.3.3.

Traverse a dict or list using a colon-delimited target string. The target 'foo:bar:0' will return data['foo']['bar'][0] if this value exists, and will otherwise return the provided default value.

Example:

{{ {'a1': {'b1': {'c1': 'foo'}}, 'a2': 'bar'} | traverse('a1:b1', 'default') }}
Returns:

{'c1': 'foo'}
{{ {'a1': {'b1': {'c1': 'foo'}}, 'a2': 'bar'} | traverse('a2:b2', 'default') }}
Returns:

'default'
NETWORKING FILTERS
The following networking-related filters are supported:

IS_IP
New in version 2017.7.0.

Return if a string is a valid IP Address.

{{ '192.168.0.1' | is_ip }}
Additionally accepts the following options:

global

link-local

loopback

multicast

private

public

reserved

site-local

unspecified

Example - test if a string is a valid loopback IP address.

{{ '192.168.0.1' | is_ip(options='loopback') }}
IS_IPV4
New in version 2017.7.0.

Returns if a string is a valid IPv4 address. Supports the same options as is_ip.

{{ '192.168.0.1' | is_ipv4 }}
IS_IPV6
New in version 2017.7.0.

Returns if a string is a valid IPv6 address. Supports the same options as is_ip.

{{ 'fe80::' | is_ipv6 }}
IPADDR
New in version 2017.7.0.

From a list, returns only valid IP entries. Supports the same options as is_ip. The list can contains also IP interfaces/networks.

Example:

{{ ['192.168.0.1', 'foo', 'bar', 'fe80::'] | ipaddr }}
Returns:

['192.168.0.1', 'fe80::']
IPV4
New in version 2017.7.0.

From a list, returns only valid IPv4 entries. Supports the same options as is_ip. The list can contains also IP interfaces/networks.

Example:

{{ ['192.168.0.1', 'foo', 'bar', 'fe80::'] | ipv4 }}
Returns:

['192.168.0.1']
IPV6
New in version 2017.7.0.

From a list, returns only valid IPv6 entries. Supports the same options as is_ip. The list can contains also IP interfaces/networks.

Example:

{{ ['192.168.0.1', 'foo', 'bar', 'fe80::'] | ipv6 }}
Returns:

['fe80::']
NETWORK_HOSTS
New in version 2017.7.0.

Return the list of hosts within a networks. This utility works for both IPv4 and IPv6.

Note

When running this command with a large IPv6 network, the command will take a long time to gather all of the hosts.

Example:

{{ '192.168.0.1/30' | network_hosts }}
Returns:

['192.168.0.1', '192.168.0.2']
NETWORK_SIZE
New in version 2017.7.0.

Return the size of the network. This utility works for both IPv4 and IPv6.

Example:

{{ '192.168.0.1/8' | network_size }}
Returns:

16777216
GEN_MAC
New in version 2017.7.0.

Generates a MAC address with the defined OUI prefix.

Common prefixes:

00:16:3E -- Xen

00:18:51 -- OpenVZ

00:50:56 -- VMware (manually generated)

52:54:00 -- QEMU/KVM

AC:DE:48 -- PRIVATE

Example:

{{ '00:50' | gen_mac }}
Returns:

00:50:71:52:1C
MAC_STR_TO_BYTES
New in version 2017.7.0.

Converts a string representing a valid MAC address to bytes.

Example:

{{ '00:11:22:33:44:55' | mac_str_to_bytes }}
Note

This option may have adverse effects when using the default renderer, jinja|yaml. This is due to the fact that YAML requires proper handling in regard to special characters. Please see the section on YAML ASCII support in the YAML Idiosyncracies documentation for more information.

DNS_CHECK
New in version 2017.7.0.

Return the ip resolved by dns, but do not exit on failure, only raise an exception. Obeys system preference for IPv4/6 address resolution.

Example:

{{ 'www.google.com' | dns_check(port=443) }}
Returns:

'172.217.3.196'
FILE FILTERS
IS_TEXT_FILE
New in version 2017.7.0.

Return if a file is text.

Uses heuristics to guess whether the given file is text or binary, by reading a single block of bytes from the file. If more than 30% of the chars in the block are non-text, or there are NUL ('x00') bytes in the block, assume this is a binary file.

Example:

{{ '/etc/salt/master' | is_text_file }}
Returns:

True
IS_BINARY_FILE
New in version 2017.7.0.

Return if a file is binary.

Detects if the file is a binary, returns bool. Returns True if the file is a bin, False if the file is not and None if the file is not available.

Example:

{{ '/etc/salt/master' | is_binary_file }}
Returns:

False
IS_EMPTY_FILE
New in version 2017.7.0.

Return if a file is empty.

Example:

{{ '/etc/salt/master' | is_empty_file }}
Returns:

False
FILE_HASHSUM
New in version 2017.7.0.

Return the hashsum of a file.

Example:

{{ '/etc/salt/master' | file_hashsum }}
Returns:

02d4ef135514934759634f10079653252c7ad594ea97bd385480c532bca0fdda
LIST_FILES
New in version 2017.7.0.

Return a recursive list of files under a specific path.

Example:

{{ '/etc/salt/' | list_files | join('\n') }}
Returns:

/etc/salt/master
/etc/salt/proxy
/etc/salt/minion
/etc/salt/pillar/top.sls
/etc/salt/pillar/device1.sls
PATH_JOIN
New in version 2017.7.0.

Joins absolute paths.

Example:

{{ '/etc/salt/' | path_join('pillar', 'device1.sls') }}
Returns:

/etc/salt/pillar/device1.sls
WHICH
New in version 2017.7.0.

Python clone of /usr/bin/which.

Example:

{{ 'salt-master' | which }}
Returns:

/usr/local/salt/virtualenv/bin/salt-master
TESTS
Saltstack extends builtin tests with these custom tests:

EQUALTO
Tests the equality between two values.

Can be used in an if statement directly:

{% if 1 is equalto(1) %}
    < statements >
{% endif %}
If clause evaluates to True

or with the selectattr filter:

{{ [{'value': 1}, {'value': 2} , {'value': 3}] | selectattr('value', 'equalto', 3) | list }}
Returns:

[{'value': 3}]
MATCH
Tests that a string matches the regex passed as an argument.

Can be used in a if statement directly:

{% if 'a' is match('[a-b]') %}
    < statements >
{% endif %}
If clause evaluates to True

or with the selectattr filter:

{{ [{'value': 'a'}, {'value': 'b'}, {'value': 'c'}] | selectattr('value', 'match', '[b-e]') | list }}
Returns:

[{'value': 'b'}, {'value': 'c'}]
Test supports additional optional arguments: ignorecase, multiline

ESCAPE FILTERS
REGEX_ESCAPE
New in version 2017.7.0.

Allows escaping of strings so they can be interpreted literally by another function.

Example:

regex_escape = {{ 'https://example.com?foo=bar%20baz' | regex_escape }}
will be rendered as:

regex_escape = https\:\/\/example\.com\?foo\=bar\%20baz
SET THEORY FILTERS
UNIQUE
New in version 2017.7.0.

Performs set math using Jinja filters.

Example:

unique = {{ ['foo', 'foo', 'bar'] | unique }}
will be rendered as:

unique = ['foo', 'bar']
JINJA IN FILES
Jinja can be used in the same way in managed files:

# redis.sls
/etc/redis/redis.conf:
    file.managed:
        - source: salt://redis.conf
        - template: jinja
        - context:
            bind: 127.0.0.1
# lib.sls
{% set port = 6379 %}
# redis.conf
{% from 'lib.sls' import port with context %}
port {{ port }}
bind {{ bind }}
As an example, configuration was pulled from the file context and from an external template file.

Note

Macros and variables can be shared across templates. They should not be starting with one or more underscores, and should be managed by one of the following tags: macro, set, load_yaml, load_json, import_yaml and import_json.

ESCAPING JINJA
Occasionally, it may be necessary to escape Jinja syntax. There are two ways to do this in Jinja. One is escaping individual variables or strings and the other is to escape entire blocks.

To escape a string commonly used in Jinja syntax such as {{, you can use the following syntax:

{{ '{{' }}
For larger blocks that contain Jinja syntax that needs to be escaped, you can use raw blocks:

{% raw %}
    some text that contains jinja characters that need to be escaped
{% endraw %}
See the Escaping section of Jinja's documentation to learn more.

A real-word example of needing to use raw tags to escape a larger block of code is when using file.managed with the contents_pillar option to manage files that contain something like consul-template, which shares a syntax subset with Jinja. Raw blocks are necessary here because the Jinja in the pillar would be rendered before the file.managed is ever called, so the Jinja syntax must be escaped:

{% raw %}
- contents_pillar: |
    job "example-job" {
      <snipped>
      task "example" {
          driver = "docker"

          config {
              image = "docker-registry.service.consul:5000/example-job:{{key "nomad/jobs/example-job/version"}}"
      <snipped>
{% endraw %}
CALLING SALT FUNCTIONS
The Jinja renderer provides a shorthand lookup syntax for the salt dictionary of execution function.

New in version 2014.7.0.

# The following two function calls are equivalent.
{{ salt['cmd.run']('whoami') }}
{{ salt.cmd.run('whoami') }}
DEBUGGING
The show_full_context function can be used to output all variables present in the current Jinja context.

New in version 2014.7.0.

Context is: {{ show_full_context()|yaml(False) }}
LOGS
New in version 2017.7.0.

Yes, in Salt, one is able to debug a complex Jinja template using the logs. For example, making the call:

{%- do salt.log.error('testing jinja logging') -%}
Will insert the following message in the minion logs:

2017-02-01 01:24:40,728 [salt.module.logmod][ERROR   ][3779] testing jinja logging
PYTHON METHODS
A powerful feature of jinja that is only hinted at in the official jinja documentation is that you can use the native python methods of the variable type. Here is the python documentation for string methods.

{% set hostname,domain = grains.id.partition('.')[::2] %}{{ hostname }}
{% set strings = grains.id.split('-') %}{{ strings[0] }}
CUSTOM EXECUTION MODULES
Custom execution modules can be used to supplement or replace complex Jinja. Many tasks that require complex looping and logic are trivial when using Python in a Salt execution module. Salt execution modules are easy to write and distribute to Salt minions.

Functions in custom execution modules are available in the Salt execution module dictionary just like the built-in execution modules:

{{ salt['my_custom_module.my_custom_function']() }}
How to Convert Jinja Logic to an Execution Module

Writing Execution Modules

CUSTOM JINJA FILTERS
Given that all execution modules are available in the Jinja template, one can easily define a custom module as in the previous paragraph and use it as a Jinja filter. However, please note that it will not be accessible through the pipe.

For example, instead of:

{{ my_variable | my_jinja_filter }}
The user will need to define my_jinja_filter function under an extension module, say my_filters and use as:

{{ salt.my_filters.my_jinja_filter(my_variable) }}
The greatest benefit is that you are able to access thousands of existing functions, e.g.:

get the DNS AAAA records for a specific address using the dnsutil:

{{ salt.dnsutil.AAAA('www.google.com') }}
retrieve a specific field value from a Redis hash:

{{ salt.redis.hget('foo_hash', 'bar_field') }}
get the routes to 0.0.0.0/0 using the NAPALM route:

{{ salt.route.show('0.0.0.0/0') }}
